MicroAIInc/MicroAI-Atom-ESP32/Security/main/esp32ai.c
/* esp32ai.c
*/
#ifndef ESP32AI_C
#define ESP32AI_C        // define allowing the header file to identify the module using it
/*    Update Log:
Date        Version        Changes
02Oct2020    01.00.00    Initial code with integrated static for security implementation
						 Also added a limit to the number of channels and provide a AI engine version number.
*/
#define    version_str    "1.0.0 - Security Monitor"        // display at power on, in the command window
/* --------------------------------------------------------------------------------------------
	SDK Limitations - these maximum limitations are imposed by the distributed SDK
	- max channels		5
	- max runtime		1296000 samples (15 days at 1 sample/sec)
	- max training time	3600 samples (60 minutes at 1 sample/sec)
   --------------------------------------------------------------------------------------------
*/ 
// CONDITIONAL COMPILE OPTIONS (see esp32ai.h)
#include <stdio.h>
#include <string.h>
#include <sys/stat.h>
#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include <math.h>
// ------- GPIO
#include "driver/gpio.h"
// ------- MQTT
#include "nvs_flash.h"
#include "protocol_examples_common.h"
#include "esp_log.h"
#include "mqtt_client.h"


#include "AiEngine.h"
#include "mqtt.h"
#include "securitychannels.h"
#include "esp32ai.h"
#include "freertos/task.h"

static TaskHandle_t                 main_task_handle;
# ifdef MQTT_ENABLE
static TaskHandle_t                 mqtt_task_handle;
#endif

static const char *TAG = "MicroAI_ESP32";
// struct for LwIP stats
extern struct stats_ lwip_stats; // found in lwip/stats.h

//***************************
// MicroAI variables
//***************************

// MicroAI input channels
typedef enum {

	E_AI_CH_0,		
	E_AI_CH_1,		
	E_AI_CH_2,	   	
	E_AI_CH_3,		
	E_AI_CH_4,		
	
	NOF_AI_CHANNELS		
} ENUM_AI_CHANNELS_USED; 
#define TOTAL_CHANNELS 		NOF_AI_CHANNELS	

#define maxCSVRowSize         200    // csv file line size
#define TIME_CONSTANT_L       100 // in the unit of the sampleingTime
#define TIME_CONSTANT_S       20
#define TIME_CONSTANT_ALRM    90
#define HEALTH_SCORE_P        90
#define DTNP                  600            // default days to next planned maintenance
#define NORMAL_DTN            40    // 90    // days to normal maintenance

sdmmc_host_t         host         = SDMMC_HOST_DEFAULT();
sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
esp_vfs_fat_sdmmc_mount_config_t mount_config = {
	.format_if_mount_failed = false,
	.max_files = 5,
	.allocation_unit_size = 16 * 1024};
sdmmc_card_t     *card;
esp_err_t         ret;
FILE             *f;
char             *modelFileX = "/sdcard/modelX";
char             *modelFileY = "/sdcard/modelY";
int             isBuildModel;
int             deleteOldModel;
uint32_t        u32CycleCount;
float             **cfg;
int             alrmReport[TOTAL_CHANNELS];
int             alrmReportNew[TOTAL_CHANNELS];    // determine which alarms are new (move out of library)
float             **ratios;
float             signalSource[TOTAL_CHANNELS];
float             signalL[TOTAL_CHANNELS]; // long memory
float             signalS[TOTAL_CHANNELS]; // short memory
float             prevSignalSource[TOTAL_CHANNELS];
float             err[TOTAL_CHANNELS];
float             mean[TOTAL_CHANNELS];
float             std[TOTAL_CHANNELS];
float             U[TOTAL_CHANNELS];
float             L[TOTAL_CHANNELS];
int             alrm[TOTAL_CHANNELS];
int             alrmNew[TOTAL_CHANNELS];    // determine which alarms are new (move out of library)
float             alrmSum;
float             filteredAlrmDensity;
float             healthScore;
float             daysToNextMaint;
int             splitCounter;
float             *predict;
float             *X;
float             *Cx;
float             *Cy;
float            **Cxx;
float            **Cyy;
int             rowCx, rowCy;            // NOTE: The code expects rowCx to be the same as rowCy!
int             colCx, colCy;
int             lenX;
int             lenY;

#define MIN_MQTT_RATE_SECS            1    // used when reading configuration
#define MAX_MQTT_RATE_SECS            20
#define DEFAULT_MQTT_RATE_SECS        10
int                mintMqttRatems;            // milliseconds between MQTT transmissions
SemaphoreHandle_t print_mux = NULL;
SemaphoreHandle_t mqtt_mux = NULL;
uint8_t    mIsLearningEnabled;
int     mintCurrTimeMsec, mintStartTimeMsec;    //use for time_span entry to send with MQTT packets (for now)
int        mintBeginTimeMsec, mintEndTimeMsec;        // to measure time intervals
#ifdef OUTPUT_METRICS
void printHeapSize();
#endif
static void free2D(float **array, int rows);
static float **alloc2D(int m, int n);
static void getRowsCols(char *fileName, int *p2Rows, int *p2Cols, char *delim, int ifPrint);
static void loadMatrix(float **x, char *fileName, char *delim, int ifPrint);
static void saveMatrix(float **x, char *fileName, char *delim, int *shape, int isAppend);
static void set0(float *x, int len) {
	int i;
	for (i = 0; i < len; i++) {
		x[i] = 0.0;
	}
}
static void free2D(float **array, int rows) {
	int ii;
	for (ii=0; ii<rows; ii++) {
		free(array[ii]);
	}
	free(array);
}
static float **alloc2D(int m, int n) {
	/*allocation memory for the 2D array (using **); Initialize them to 0.0*/
	int i, j;
	float **array;
	array = malloc(m * sizeof *array);
	if (array == NULL) {
		fprintf(stderr, "out of memory for 2D array\n");
		#ifdef MICROAI_DEBUG
		printf("\nout of memory for 2D array-1\n");
		#endif
		exit(0);
	}
	for (i = 0; i < m; i++) {
		array[i] = malloc(n * sizeof *array[i]);
		if (array[i] == NULL) {
			fprintf(stderr, "out of memory for 2D array\n");
			#ifdef MICROAI_DEBUG
			printf("\nout of memory for 2D array-2\n");
			#endif
			exit(0);
		}
		for (j = 0; j < n; j++) {
			array[i][j] = 0.0;
			/*          printf("%d ,  %d ,=%f  \n",i,j,array[i][j]);*/
		}
	}
	return array;
}
static void getRowsCols(char *fileName, int *p2Rows, int *p2Cols, char *delim, int ifPrint) {
	/*read number of rows and columns from 2D array from a csv file (or other with different delimiters)*/
	int i = 0;
	int j = 0;
	int nofRows = 0;
	int nofCols = 0;
	*p2Rows = 0;
	*p2Cols = 0;
	FILE *F;
	F = fopen(fileName, "r");
	if (F == NULL) {
		printf("Cannot open the file ");
		printf("%s\n", fileName);
		exit(0);
	}
	char buf[maxCSVRowSize];
	char *line, *record;
	char *temp = "0";
	record = temp;
	line = fgets(buf, sizeof(buf), F);
	while (line != NULL) {
		record = strtok(line, delim);
		//           printf("%s",line);
		while (record != NULL) {
			record = strtok(NULL, ",");
			j = j + 1;
		}
		if (nofCols < j)    // remember the greatest column
			nofCols = j;
		i = i + 1;
		j = 0;
		line = fgets(buf, sizeof(buf), F);
		nofRows++;
	}
	if (ifPrint == 1) {
		printf("Rows: %d, Columns: %d\n", nofRows, nofCols);
	}
	*p2Rows = nofRows;
	*p2Cols = nofCols;
	if (line != NULL) {
		free(line);
	}
	free(record);
	fclose(F);
}
static void loadMatrix(float **x, char *fileName, char *delim, int ifPrint) {
	/*read 2D array from a csv file*/
	int i = 0;
	int j = 0;
	FILE *F;
	F = fopen(fileName, "r");
	if (F == NULL) {
		printf("Cannot open the file ");
		printf("%s", fileName);
		exit(0);
	}
	char buf[maxCSVRowSize];
	char *line, *record = "0";            // initialize to prevent compiler warning
	line = fgets(buf, sizeof(buf), F);
	while (line != NULL) {
		record = strtok(line, delim);
		//           printf("%s",line);
		while (record != NULL) {
			x[i][j] = atof(record);
			record = strtok(NULL, ",");
			if (ifPrint == 1) {
				printf("x[%d][%d] = %f\n", i, j, x[i][j]);
			}
			j = j + 1;
		}
		i = i + 1;
		j = 0;
		line = fgets(buf, sizeof(buf), F);
	}
	free(line);
	free(record);
	fclose(F);
}
static void saveMatrix(float **x, char *fileName, char *delim, int *shape,
				int isAppend) {
	// define a function that transfer 1d array into a csv string which is
	// actually 2d
	FILE *F;
	if (isAppend == 1) {
		F = fopen(fileName, "a");
	} else {
		F = fopen(fileName, "w");
	}
	int i, j;
	char *tmpS = malloc(sizeof *tmpS * maxCSVRowSize);
	for (i = 0; i < shape[0]; i++) {
		for (j = 0; j < shape[1]; j++) {
			if ((j - shape[1]) == -1) {
				free(tmpS);
				tmpS = malloc(sizeof *tmpS * maxCSVRowSize);
				sprintf(tmpS, "%f", x[i][j]);
				fputs(tmpS, F);
				fputs("\n", F);
			} else {
				free(tmpS);
				tmpS = malloc(sizeof *tmpS * maxCSVRowSize);
				sprintf(tmpS, "%f", x[i][j]);
				fputs(tmpS, F);
				fputc(',', F);
			}
		}
	}
	free(tmpS);
	fclose(F);
	// fputs all strings to file
	// add /n at the row end index
	//  return 0;
}
static int f2i(float x) { return (((int)(x + 32768.5)) - 32768); }
void updateDataBuffer(int ch_index, float *databuf)
{
	databuf[E_CURRENT_VAL]         = signalSource[ch_index];
	databuf[E_UPPER_BOUND]         = U[ch_index];
	databuf[E_LOWER_BOUND]         = L[ch_index];
	databuf[E_URGENT_ALARM]     = alrmReport[ch_index];
	databuf[E_HEALTH_SCORE]     = healthScore;
	databuf[E_DAYS_TO_MAINT]     = daysToNextMaint;
	databuf[E_ALARM]             = alrmReport[ch_index];
}

#ifdef OUTPUT_METRICS
void printHeapSize()
{
		size_t        free_heap = esp_get_free_heap_size();    //xPortGetFreeHeapSize();
		size_t        min_free_heap = xPortGetMinimumEverFreeHeapSize();
static     uint32_t    prevFreeHeap = 0;
	xSemaphoreTake(print_mux, portMAX_DELAY);
	printf( "\n *** Free Heap: %d (%d), Min: %d\r\n", (int32_t)free_heap, (int32_t)(free_heap-prevFreeHeap), (int32_t)min_free_heap );
	xSemaphoreGive(print_mux);
	prevFreeHeap = free_heap;
}
#endif
//***************************
// SD card functions
//***************************
// Initialize SD card and read files
//    * init SD card
//        - confirm card is present and writeable
//        - read config files and copy arrays
//    * set up build model, if necessary, including deleting old model
static void initSDcard( void )
{
#ifdef OUTPUT_MODEL_FIRST_LOOP
	static uint8_t         isFirstLoop = true;        // only output on the first loop
#endif
	ESP_LOGI(TAG, "Initializing SD card");
	ESP_LOGI(TAG, "Using SDMMC peripheral");

