MicroAIInc/MicroAI-Atom-ESP32/Security/main/esp32ai.c
	// To use 1-line SD mode, uncomment the following line:
	// slot_config.width = 1;
	// GPIOs 15, 2, 4, 12, 13 should have external 10k pull-ups.
	// Internal pull-ups are not sufficient. However, enabling internal pull-ups
	// does make a difference some boards, so we do that here.
	gpio_set_pull_mode(15, GPIO_PULLUP_ONLY); // CMD, needed in 4- and 1- line modes
	gpio_set_pull_mode(2,  GPIO_PULLUP_ONLY); // D0, needed in 4- and 1-line modes
	gpio_set_pull_mode(4,  GPIO_PULLUP_ONLY); // D1, needed in 4-line mode only
	gpio_set_pull_mode(12, GPIO_PULLUP_ONLY); // D2, needed in 4-line mode only
	gpio_set_pull_mode(13, GPIO_PULLUP_ONLY); // D3, needed in 4- and 1-line modes
	// Options for mounting the filesystem.
	// If format_if_mount_failed is set to true, SD card will be partitioned and
	// formatted in case when mounting fails.

	// Note: esp_vfs_fat_sdmmc_mount is an all-in-one convenience function.
	// Please check its source code and implement error recovery when developing
	// production applications.
	ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config,
										&mount_config, &card);
	if (ret != ESP_OK) {
		if (ret == ESP_FAIL) {
			ESP_LOGE(TAG, "Failed to mount filesystem. "
						  "If you want the card to be formatted, set "
						  "format_if_mount_failed = true.");
		} else {
			ESP_LOGE(TAG,
					 "Failed to initialize the card (%s). "
					 "Make sure SD card lines have pull-up resistors in place.",
					 esp_err_to_name(ret));
		}
		return;
	}
	// Card has been initialized, print its properties
	sdmmc_card_print_info(stdout, card);
	// Use POSIX and C standard library functions to work with files.
	// First create a file.
	ESP_LOGI(TAG, "Opening test file");
	f = fopen("/sdcard/hello.txt", "w");
	if (f == NULL) {
		ESP_LOGE(TAG, "Failed to open file for writing");
		return;
	}
	fprintf(f, "Hello %s!\n", card->cid.name);
	fclose(f);
	ESP_LOGI(TAG, "File written");
	lenX = TOTAL_CHANNELS * 3;
	lenY = TOTAL_CHANNELS;
	//// load microAI cfg file;
	//// read cfg
	int i;
	int cols = 1;
	int rows = NOF_CONFIG_FILE_ENTRIES;
	char *srcFile = "/sdcard/cfg";
	getRowsCols(srcFile, &rows, &cols, ",", 1);
	if (rows < NOF_CONFIG_FILE_ENTRIES) {         //rows = NOF_CONFIG_FILE_ENTRIES;                // minimum size to allocate
		ESP_LOGE(TAG, "Incorrect config file (%d out of %d entries)\n", rows, NOF_CONFIG_FILE_ENTRIES);
		while (1);    // force stop here, else it will fail later
	}
	cfg = alloc2D(rows, cols);
	loadMatrix(cfg, srcFile, ",", 0);            // do not print these parameters until we validate them
#ifdef TEMP_FIXED_CFG_PARAMETERS
	printf("\nPrevious parameters:\n");
	for (i = 0; i < NOF_CONFIG_FILE_ENTRIES; i++) {
		printf("cfg[%d][0] = %f\n", i, cfg[i][0]);
	}
	cfg[E_STD_CAL_GAIN][0] = 0.5;
	cfg[E_MEAN_CAL_GAIN][0] = 0.6;
#endif
//===== load sigmaRatios from algPar file
	char *ratioFile = "/sdcard/algPar";
	getRowsCols(ratioFile, &rows, &cols, ",", 1);    // determine how many rows and cols are present
	if (rows < TOTAL_CHANNELS) {                         // minimum size to allocate
		ESP_LOGE(TAG, "Incorrect algPar file (%d out of %d entries)\n", rows, TOTAL_CHANNELS);
		while (1);    // force stop here, else it will fail later - consider testing for columns as well
	}
	ratios = alloc2D(rows, cols);
	loadMatrix(ratios, ratioFile, ",", 0);            // do not print these parameters until we validate them
//=====
	/**SETUP for the main task**/
	isBuildModel = f2i(*cfg[E_IS_BUILD_MODEL]);
	#ifdef USE_BUILD_MODEL_JUMPER
	isBuildModel = mIsLearningEnabled;                    // the hardware jumper overrides this now
	#endif
	deleteOldModel = f2i(*cfg[E_IS_DELETE_OLD]);
	if ((deleteOldModel == 1) && (isBuildModel == 1)) {
		if (remove(modelFileX)) {
			ESP_LOGI(TAG, "File X removed");
		}
		else {
			f = fopen(modelFileX, "w");                           //remove(modelFileX);
			if (f == NULL) {
				ESP_LOGE(TAG, "Failed to open file X for writing");
			}
			else {
				fputc(' ', f);
				fclose(f);
				ESP_LOGI(TAG, "File X erased");
			}
		}
		if (remove(modelFileY)) {
			ESP_LOGI(TAG, "File Y removed");
		}
		else {
			f = fopen(modelFileY, "w");                            //remove(modelFileY);
			if (f == NULL) {
				ESP_LOGE(TAG, "Failed to open file Y for writing");
				return;
			}
			else {
				fputc(' ', f);
				fclose(f);
				ESP_LOGI(TAG, "File Y erased");
			}
		}
	}
	else if (isBuildModel == 0)     // normal mode, so load up the model data here
	{
		//printf("\n*** Before malloc: ");
		//printHeapSize();
		getRowsCols(modelFileX, &rowCx, &colCx, ",", 0);    // determine the memory allocation required
		getRowsCols(modelFileY, &rowCy, &colCy, ",", 0);    // determine the memory allocation required
		if (rowCx < 5)
			rowCx = 5;                        // minimum size to allocate
		if (colCx < lenX)
			colCx = lenX;
		if (rowCy < 5)
			rowCy = 5;                    // minimum size to allocate
		if (colCy < lenY)
			colCy = lenY;
		if (rowCx < rowCy) {
			rowCx = rowCy;                // allocate memory for the greatest size, if different
			ESP_LOGE(TAG, "File X has less rows than File Y");
		}
		if (rowCy < rowCx) {
			rowCy = rowCx;
			ESP_LOGE(TAG, "File Y has less rows than File X");
		}
		Cxx = alloc2D(rowCx, colCx);        // Cxx = alloc2D(rowCxCy, lenX);        lenX = TOTAL_CHANNELS * 3
		Cyy = alloc2D(rowCy, colCy);        // Cyy = alloc2D(rowCxCy, lenY);
		if (Cxx == NULL)
			ESP_LOGE(TAG, "Cxx is NULL (no memory allocated)");
		if (Cyy == NULL)
			ESP_LOGE(TAG, "Cyy is NULL (no memory allocated)");
		#ifdef OUTPUT_MODEL_FIRST_LOOP
			if (isFirstLoop == true) {
				loadMatrix(Cxx, "/sdcard/modelX", ",", 1);        // special printout case
				loadMatrix(Cyy, "/sdcard/modelY", ",", 1);
				isFirstLoop = false;
			}
			else {
				loadMatrix(Cxx, "/sdcard/modelX", ",", 0);        // normal case
				loadMatrix(Cyy, "/sdcard/modelY", ",", 0);
			}
		#else
			loadMatrix(Cxx, "/sdcard/modelX", ",", 0);        // normal case
			loadMatrix(Cyy, "/sdcard/modelY", ",", 0);
		#endif
	}
#ifdef OUTPUT_METRICS
	if (isBuildModel)
		printf(" *** Training Seconds = %d ***\n", (int)cfg[E_TRAINING_SECONDS][0]);
#endif
	// Validate the config file entries
	mintMqttRatems = f2i(cfg[E_MQTT_SAMPLE_RATE_SECS][0]);            // make this conversion one time
	if (mintMqttRatems < MIN_MQTT_RATE_SECS)                        // validate the entry
		mintMqttRatems = DEFAULT_MQTT_RATE_SECS;                    // if invalid, use the default
	else if (mintMqttRatems > MAX_MQTT_RATE_SECS)
		mintMqttRatems = DEFAULT_MQTT_RATE_SECS;
	cfg[E_MQTT_SAMPLE_RATE_SECS][0] = mintMqttRatems;                // put back in the array for the upcoming print function
	mintMqttRatems *= 1000;                                            // convert to milliseconds
	printf("\nConfig parameters:\n");
	for (i = 0; i < NOF_CONFIG_FILE_ENTRIES; i++) {
		printf("cfg[%d][0] = %.3f\n", i, cfg[i][0]);
	}

	// Consider validating the AlgPar entries too...
	printf("\nAlgPar:\n");
	for (i = 0; i < TOTAL_CHANNELS; i++) {
		printf("ratios[%d] = %.1f, %.1f\n", i, ratios[i][0], ratios[i][1]);
	}
}
void initGPIO()
{
	gpio_config_t io_conf;
	// inputs...
	//disable interrupt
	io_conf.intr_type = GPIO_PIN_INTR_DISABLE;
	//bit mask of the pins, use GPIO27
	io_conf.pin_bit_mask = GPIO_INPUT_PIN_SEL;
	//set as input mode
	io_conf.mode = GPIO_MODE_INPUT;
	//enable pull-up mode
	io_conf.pull_up_en = 1;
	gpio_config(&io_conf);
}

