MicroAIInc/MicroAI-Atom-ESP32/Security/main/esp32ai.c
static void main_task(void *arg)
{
	int                 i;
	SecurityChannels_t    security_array;
	int                    intAlarm, intAlarmReport;
	uint32_t            u32RuntimeSeconds;
	int                 shape[2] = {TOTAL_CHANNELS, TOTAL_CHANNELS};
	char                 *modelFileX = "/sdcard/modelX";
	char                 *modelFileY = "/sdcard/modelY";
	#ifdef OUTPUT_METRICS
	TickType_t            xTime1, xTime2;
	uint32_t            ulTime1=0;    //, ulTime2=0;
	uint32_t            ulTemp;
	#endif

	// Initialize variables
	alrmSum = 0.0;
	filteredAlrmDensity = 0.0;
	healthScore = 100.0;
	daysToNextMaint = NORMAL_DTN;
	while (1)
	{
		if (read_network_data(&security_array) == true)         // elapsed time for if(): 29-30 msec
		{
			for (i = 0; i < TOTAL_CHANNELS; i++) {
				prevSignalSource[i] = signalSource[i];                    // before updating the signals, save the previous
			}
			// assign the values to be processed by AI engine
			signalSource[E_AI_CH_0]         = security_array.data[E_CH_0];
			signalSource[E_AI_CH_1]         = security_array.data[E_CH_1];
			signalSource[E_AI_CH_2]         = security_array.data[E_CH_2];
			signalSource[E_AI_CH_3]         = security_array.data[E_CH_3];
			signalSource[E_AI_CH_4]     	= security_array.data[E_CH_4];
	
			u32RuntimeSeconds = xTaskGetTickCount()/1000;        // determine the number of runtime seconds
			microAI_task(0, u32CycleCount, signalSource,        // execution time: 1-2 msec
						Cxx, Cyy, rowCx, lenX, lenY,
						signalL, signalS, cfg, X,
						isBuildModel, Cx, Cy, splitCounter,
						predict, prevSignalSource, err, mean,
						std, U, L, alrm, &filteredAlrmDensity,
						&healthScore, &alrmSum, &daysToNextMaint,
						alrmReport, ratios);
			// test for new alarm condition, then output it via MQTT if true
			intAlarmReport = 0;
			intAlarm = 0;
			for (i = 0; i < TOTAL_CHANNELS; i++) {
				intAlarmReport |= alrmReport[i];
				if ((alrmReport[i] > 0) && (alrmReportNew[i] == 0))        // new alarm condition? (only send a message if it is new)
				{
					alrmReportNew[i] = 1;
					#ifdef MQTT_ALERT_ENABLE
						send_mqtt_alert_msg(i);
					#endif
				}
				else
					alrmReportNew[i] = 0;
				#ifdef CHECK_FOR_NEW_ALARM
				intAlarm |= alrm[i];
				if ((alrm[i] > 0) && (alrmNew[i] == 0))        // new alarm condition? (only send a message if it is new)
				{
					alrmNew[i] = 1;
				}
				#endif
			}
			// check to see if it's time to save training data
			if ((isBuildModel == 1) &&
				(u32CycleCount >= ((int)cfg[E_INITIAL_PERIOD][0])))
			{
				if (u32RuntimeSeconds >= cfg[E_TRAINING_SECONDS][0]) {
					printf("\n *** TRAINING COMPLETE *** \n\n");
					printf("\n Power Off, then train again or disable training mode \n\n");
					vTaskDelay(300000 / portTICK_RATE_MS);		// delay 5 minutes
				}
				else if (u32CycleCount % splitCounter == (splitCounter - 1)) {
					shape[0] = 1;                                // save every "splitCounter" number of cycles
					shape[1] = TOTAL_CHANNELS * 3;
					saveMatrix(&Cx, modelFileX, ",", shape, 1); // append model rows
					shape[1] = TOTAL_CHANNELS;
					saveMatrix(&Cy, modelFileY, ",", shape, 1); // append model rows
					printf("model rows ADDED \n");
				}
			}
			#ifdef OUTPUT_AI_DATA        // for test purposes only (does not output alarm data to the monitor)
			if ((intAlarmReport > 0) && (isBuildModel == 0)) {
				// Use this to visually see when alarms are present (not good if capturing data to be analyzed)
				printf("\n");
				ESP_LOGW(TAG, "Alarm REPORT: %d, %d, %d, %d, %d", alrmReport[0],alrmReport[1],alrmReport[2],alrmReport[3],alrmReport[4]);
				printf("\n Abnormal security behavior");
			}
			else
				printf("\n Normal security behavior");
			if (u32CycleCount == 0)
				//printf("count,U_0,L_0,R_0,Time_0,Alrm_0,U_1,L_1,R_1,Time_1,Alrm_1,U_2,L_2,R_2,Time_2,Alrm_2,U_3,L_3,R_3,Time_3,Alrm_3,U_4,L_4,R_4,Time_4,Alrm_4 \n");        // version 2
			//printf("%3d", u32CycleCount);
			#else    // #ifdef OUTPUT_AI_DATA
			#ifdef MQTT_ALARM_ENABLE
			if ((intAlarmReport > 0) && (isBuildModel == 0)) {
				// Use this to visually see when alarms are present (not good if capturing data to be analyzed)
				ESP_LOGW(TAG, "Alarm: %d, %d, %d, %d, %d", alrmReport[0],alrmReport[1],alrmReport[2],alrmReport[3],alrmReport[4]);
				for (i = 0; i < TOTAL_CHANNELS; i++) {
					printf(" %f ", signalSource[i]);
				}
				printf(" =R=\n");
				for (i = 0; i < TOTAL_CHANNELS; i++) {
					printf(" %f ", U[i]);
				}
				printf(" =U=\n");
				for (i = 0; i < TOTAL_CHANNELS; i++) {
					printf(" %f ", L[i]);
				}
				printf(" =L=\n\n");
			}
			#endif    // #ifdef MQTT_ALARM_ENABLE
			#endif    // #ifdef OUTPUT_AI_DATA
			u32CycleCount++;
		}
		else
		{
			xSemaphoreTake(print_mux, portMAX_DELAY);
			printf("\n*** Read Security Channels FAILED ***\n");
			xSemaphoreGive(print_mux);
		}
		mintCurrTimeMsec = xTaskGetTickCount();
		
		#ifdef OUTPUT_METRICS
			printf("\n *** Elapsed Sec's: %.1f \n", (float)(mintCurrTimeMsec-mintStartTimeMsec)/1000);
			//xTime1 = main_task_handle.ulRunTimeCounter;
			//xTime1 = xTime2;                // remember the previous time    Total loop: 1.2 secs
			//xTime2 = xTaskGetTickCount();    // get the current time
			//ulTime1 = esp_timer_impl_get_time;    //os_cputime_get32();
			// then do something to determine the time consumed and print it out
						ulTemp = uxTaskGetStackHighWaterMark(main_task_handle);
			xSemaphoreTake(print_mux, portMAX_DELAY);
			//printf(" *** Elapsed Ticks: %d, Stack: %d\n", xTime2-xTime1, ulTime1);
			printf(" *** Min Stack level: %d", ulTemp);
			printHeapSize();
		#endif
		vTaskDelay(MAIN_TASK_LOOP_DELAY_MS / portTICK_RATE_MS);        // see esp32ai.h
	} // while (1)
	vSemaphoreDelete(print_mux);
	vSemaphoreDelete(mqtt_mux);
	free2D(Cyy, rowCy);
	free2D(Cxx, rowCx);
	vTaskDelete(NULL);
}
void app_main()
{
	//*****************************************
	// Set up GPIO and show results
	//*****************************************
	initGPIO();                                    // set up to read for enabled MQTT output and MicroAI Learning
	if (gpio_get_level(GPIO_IS_MQTT_ENABLED) == 1) {
		printf("\n *** MQTT output ON\n");
	}
	else {
		printf("\n *** MQTT output Off (remove jumper from IO27 to enable)\n");
	}
	if (gpio_get_level(GPIO_LEARNING_DISABLED) == 0)
	{
		// Test a 2nd time before setting this active
		if (gpio_get_level(GPIO_LEARNING_DISABLED) == 0) {
			printf("\n *** Learn Mode: ON\n\n");
			mIsLearningEnabled = true;
			vTaskDelay(5000);
		}
	}
	else
	{
		printf("\n *** Learn Mode: Off (connect jumper from GND to IO26 to enable, then reboot)\n\n");
		mIsLearningEnabled = false;
	}
	mintStartTimeMsec = xTaskGetTickCount();    //xthal_get_ccount();
	//*****************************************
	// Set up configuration
	//*****************************************
	initSDcard();        // confirm SD card access, read config files (also uses mIsLearningEnabled)
	//*****************************************
	// Set up MicroAI function
	//*****************************************
	if (initAI( TIME_CONSTANT_L, TIME_CONSTANT_S, TIME_CONSTANT_ALRM,
				HEALTH_SCORE_P, DTNP, NORMAL_DTN, TOTAL_CHANNELS) == 0)
	{
		printf("\n\n\n *** AI init failed *** \n\n\n");
		vTaskDelay(5000);
	}
	X = malloc(sizeof *X * (3 * TOTAL_CHANNELS));
	Cx = malloc(sizeof *X * (3 * TOTAL_CHANNELS));
	Cy = malloc(sizeof *X * (TOTAL_CHANNELS));
	splitCounter = f2i(cfg[E_SPLIT_COUNTER][0]);
	predict = malloc(sizeof *predict * (TOTAL_CHANNELS));
	set0(X, TOTAL_CHANNELS * 3);
	set0(Cx, TOTAL_CHANNELS * 3);
	set0(Cy, TOTAL_CHANNELS);
	set0(predict, TOTAL_CHANNELS);
	set0(err, TOTAL_CHANNELS);
	set0(mean, TOTAL_CHANNELS);
	set0(std, TOTAL_CHANNELS);
	set0(U, TOTAL_CHANNELS);
	set0(L, TOTAL_CHANNELS);
	for (int ii = 0; ii < TOTAL_CHANNELS; ii++) {
		std[ii] = 0;
		alrm[ii] = 0;
		alrmReport[ii] = 0;
		alrmReportNew[ii] = 0;
	}
	//*****************************************
	// Set up MQTT
	//*****************************************
	# ifdef MQTT_ENABLE
	initMqtt(mintMqttRatems);
	#endif //MQTT_ENABLE
	//*****************************************
	// Then set up the rest
	//*****************************************
	print_mux = xSemaphoreCreateMutex();        // mutex for sharing printing between 2 tasks
	mqtt_mux = xSemaphoreCreateMutex();
#ifdef OUTPUT_METRICS
	printHeapSize();
#endif
	//*****************************************
	// show current version
	//*****************************************
	printf("\n\n **********************\n");
	printf(    " *\n");
	printf(    " * ESP32\n");
	printf(    " * Version: %s\n", version_str);
	printf(    " *\n");
	printf(    " * MicroAI Engine\n");
	printf(    " * Version: %s\n", GetAiEngLibVersion());
	printf(    " *\n");
	printf(    " * SecurityLibrary\n"); 
	printf(    " * Version: %s\n", GetSecurityLibVersion());

	printf(    " *\n");
	printf(    " ********************** \n\n\n");
	
	# ifndef MQTT_ENABLE
	//***************************************************
	// TCP serer initialization and establish connection
	//***************************************************
	ESP_ERROR_CHECK(nvs_flash_init());
	tcpip_adapter_init();
	ESP_ERROR_CHECK(esp_event_loop_create_default());
	/* This helper function configures Wi-Fi or Ethernet, as selected in menuconfig.
	 * Read "Establishing Wi-Fi or Ethernet Connection" section in
	 * examples/protocols/README.md for more information about this function.
	 */
	ESP_ERROR_CHECK(example_connect());
	
	#endif //MQTT_ENABLE
	//*****************************************
	// Then start the tasks
	//*****************************************
	//xTaskCreate(function,            task name,       stack size, params,   priority (0=lowest), handle);
	xTaskCreate(main_task,             "MainTask",        2048 * 2, (void *)0, 10,                 &main_task_handle);
	# ifdef MQTT_ENABLE
	xTaskCreate(mqtt_task,             "MqttTask",        2048 * 2, (void *)2, 10,                 &mqtt_task_handle);
	#endif //MQTT_ENABLE
}
#endif    // #ifndef MICROAI_C